Reynolds/Re250/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    "inner_wall"
    {

        type            rotatingWallVelocity;
        origin          ( 0 0 0 );
        axis            ( 0 0 1 );
        omega           1; // rad/s

    }

    "outer_wall"
    {

        type            rotatingWallVelocity;
        origin          ( 0 0 0 );
        axis            ( 0 0 1 );
        omega           0; // rad/s

    }

    "top"               {type slip;}
    "bottom"            {type slip;}

}

// ************************************************************************* //
